{
  "id": "PA",
  "name": "Private Pilot for Airplane Category",
  "areas": [
    {
      "id": "I",
      "name": "Preflight Preparation",
      "tasks": [
        {
          "id": "A",
          "name": "Pilot Qualifications",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with airman and medical certificates including privileges, limitations, currency, and operating as pilot-in-command as a private pilot.",
          "knowledge": [
            {
              "id": 1,
              "content": "Certification requirements, recent flight experience, and recordkeeping."
            },
            {
              "id": 2,
              "content": "Privileges and limitations."
            },
            {
              "id": 3,
              "content": "Medical certificates: class, expiration, privileges, temporary disqualifications."
            },
            {
              "id": 4,
              "content": "Documents required to exercise private pilot privileges."
            },
            {
              "id": 5,
              "content": "Part 68 BasicMed privileges and limitations."
            }
          ],
          "riskManagement": [
            {
              "id": 1,
              "content": "Proficiency versus currency."
            },
            {
              "id": 2,
              "content": "Flying unfamiliar aircraft or operating with unfamiliar flight display systems and avionics."
            }
          ],
          "skills": [
            {
              "id": 1,
              "content": "Apply requirements to act as pilot-in-command (PIC) under Visual Flight Rules (VFR) in a scenario given by the evaluator."
            }
          ]
        },
        {
          "id": "B",
          "name": "Airworthiness Requirements",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with airworthiness requirements, including airplane certificates.",
          "knowledge": [
            {
              "id": 1,
              "content": "General airworthiness requirements and compliance for airplanes, including:",
              "subElements": [
                {
                  "id": "a",
                  "content": "Location and expiration dates of required aircraft certificates"
                },
                {
                  "id": "b",
                  "content": "Required inspections and airplane logbook documentation"
                },
                {
                  "id": "c",
                  "content": "Airworthiness Directives and Special Airworthiness Information Bulletins"
                },
                {
                  "id": "d",
                  "content": "Purpose and procedure for obtaining a special flight permit"
                },
                {
                  "id": "e",
                  "content": "Owner/Operator and pilot-in-command responsibilities"
                }
              ]
            },
            {
              "id": 2,
              "content": "Pilot-performed preventive maintenance."
            },
            {
              "id": 3,
              "content": "Equipment requirements for day and night VFR flight, including:",
              "subElements": [
                {
                  "id": "a",
                  "content": "Flying with inoperative equipment"
                },
                {
                  "id": "b",
                  "content": "Using an approved Minimum Equipment List (MEL)"
                },
                {
                  "id": "c",
                  "content": "Kinds of Operation Equipment List (KOEL)"
                },
                {
                  "id": "d",
                  "content": "Required discrepancy records or placards"
                }
              ]
            },
            {
              "id": 4,
              "content": "Standard and special airworthiness certificates and their associated operational limitations."
            }
          ],
          "riskManagement": [
            {
              "id": 1,
              "content": "Inoperative equipment discovered prior to flight."
            }
          ],
          "skills": [
            {
              "id": 1,
              "content": "Locate and describe airplane airworthiness and registration information."
            },
            {
              "id": 2,
              "content": "Determine the airplane is airworthy in the scenario given by the evaluator."
            },
            {
              "id": 3,
              "content": "Apply appropriate procedures for operating with inoperative equipment in the scenario given by the evaluator."
            }
          ]
        },
        {
          "id": "C",
          "name": "Weather Information",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with weather information for a flight under VFR.",
          "knowledge": [
            {
              "id": 1,
              "content": "Sources of weather data (e.g., National Weather Service, Flight Service) for flight planning purposes."
            },
            {
              "id": 2,
              "content": "Acceptable weather products and resources required for preflight planning, current and forecast weather for departure, en route, and arrival phases of flight such as:",
              "subElements": [
                {
                  "id": "a",
                  "content": "Airport Observations (METAR and SPECI) and Pilot Observations (PIREP)"
                },
                {
                  "id": "b",
                  "content": "Surface Analysis Chart, Ceiling and Visibility Chart (CVA)"
                },
                {
                  "id": "c",
                  "content": "Terminal Aerodrome Forecasts (TAF)"
                },
                {
                  "id": "d",
                  "content": "Graphical Forecasts for Aviation (GFA)"
                },
                {
                  "id": "e",
                  "content": "Wind and Temperature Aloft Forecast (FB)"
                },
                {
                  "id": "f",
                  "content": "Convective Outlook (AC)"
                },
                {
                  "id": "g",
                  "content": "Inflight Aviation Weather Advisories including Airmen's Meteorological Information (AIRMET), Significant Meteorological Information (SIGMET), and Convective SIGMET"
                }
              ]
            },
            {
              "id": 3,
              "content": "Meteorology applicable to the departure, en route, alternate, and destination under visual flight rules (VFR) in Visual Meteorological Conditions (VMC), including expected climate and hazardous conditions such as:",
              "subElements": [
                {
                  "id": "a",
                  "content": "Atmospheric composition and stability"
                },
                {
                  "id": "b",
                  "content": "Wind (e.g., windshear, mountain wave, factors affecting wind, etc.)"
                },
                {
                  "id": "c",
                  "content": "Temperature and heat exchange"
                },
                {
                  "id": "d",
                  "content": "Moisture/precipitation"
                },
                {
                  "id": "e",
                  "content": "Weather system formation, including air masses and fronts"
                },
                {
                  "id": "f",
                  "content": "Clouds"
                },
                {
                  "id": "g",
                  "content": "Turbulence"
                },
                {
                  "id": "h",
                  "content": "Thunderstorms and microbursts"
                },
                {
                  "id": "i",
                  "content": "Icing and freezing level information"
                },
                {
                  "id": "j",
                  "content": "Fog/mist"
                },
                {
                  "id": "k",
                  "content": "Frost"
                },
                {
                  "id": "l",
                  "content": "Obstructions to visibility (e.g., smoke, haze, volcanic ash, etc.)"
                }
              ]
            },
            {
              "id": 4,
              "content": "Flight deck instrument displays of digital weather and aeronautical information."
            }
          ]
        },
        {
          "id": "D",
          "name": "Cross-Country Flight Planning",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with cross-country flights and VFR flight planning"
        },
        {
          "id": "E",
          "name": "National Airspace System",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with National Airspace System (NAS) operations under VFR as a private pilot."
        },
        {
          "id": "F",
          "name": "Performance Limitations",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with operating an airplane safely within the parameters of its performance capabilities and limitations."
        },
        {
          "id": "G",
          "name": "Operation of Systems",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with safe operation of systems on the airplane provided for the flight test."
        },
        {
          "id": "H",
          "name": "Human Factors",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with personal health, flight physiology, and aeromedical and human factors related to safety of flight."
        },
        {
          "id": "I",
          "name": "Water and Seaplane Characteristics, Seaplane Bases, Maritime Rules, and Aids to Marine Navigation",
          "appliesTo": ["ASES", "AMES"],
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with water and seaplane characteristics, seaplane bases, maritime rules, and aids to marine navigation."
        }
      ]
    },
    {
      "id": "II",
      "name": "Preflight Procedures",
      "tasks": [
        {
          "id": "A",
          "name": "Preflight Assessment",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with preparation for safe flight."
        },
        {
          "id": "B",
          "name": "Flight Deck Management",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with flight deck management practices."
        },
        {
          "id": "C",
          "name": "Engine Starting",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with recommended engine starting procedures."
        },
        {
          "id": "D",
          "name": "Taxiing",
          "appliesTo": ["ASEL", "AMEL"],
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with taxi operations, including runway incursion avoidance."
        },
        {
          "id": "E",
          "name": "Taxiing and Sailing",
          "appliesTo": ["ASES", "AMES"],
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with taxiing and sailing operations, including runway incursion avoidance."
        },
        {
          "id": "F",
          "name": "Before Takeoff Check",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with before takeoff check."
        }
      ]
    },
    {
      "id": "III",
      "name": "Airport and Seaplane Base Operations",
      "tasks": [
        {
          "id": "A",
          "name": "Communications, Light Signals, and Runway Lighting Systems",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with normal and emergency radio communications, air traffic control (ATC) light signals, and runway lighting systems."
        },
        {
          "id": "B",
          "name": "Traffic Patterns",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with traffic patterns."
        }
      ]
    },
    {
      "id": "IV",
      "name": "Takeoffs, Landings, and Go-Arounds",
      "tasks": [
        {
          "id": "A",
          "name": "Normal Takeoff and Climb",
          "objective": "To determine the applicant exhibits satisfactory knowledge, risk management, and skills associated with normal takeoff, climb operations, and rejected takeoff procedures."
        }
      ]
    }
  ]
}
